In [1]:
# Import Pandas Library
import pandas as pd

# Create a dictionary, with a list of grades associated with each name
grades_dict= {'Walley':[87,96,70], 'Eva':[100,87,90], 'Sam':[94,77,90], 'Katie':[100,81,82], 'Bob':[83,65,85]}

# Create a DataFrame using the dictionary, with test names for each row
grades= pd.DataFrame(grades_dict,['Test1','Test2','Test3'])

In [2]:
# Print out the DataFrame
grades

       Walley  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test2      96   87   77     81   65
Test3      70   90   90     82   85

In [3]:
# For each value in the DataFrane, is it greater than 90?
grades > 90

       Walley    Eva    Sam  Katie    Bob
Test1   False   True   True   True  False
Test2    True  False  False  False  False
Test3   False  False  False  False  False

In [4]:
# Show only those values that are greater than 90, otherwise, show NaN ("not a number").
grades[grades > 90]

       Walley    Eva   Sam  Katie  Bob
Test1     NaN  100.0  94.0  100.0  NaN
Test2    96.0    NaN   NaN    NaN  NaN
Test3     NaN    NaN   NaN    NaN  NaN

In [5]:
# Show only those values that are greater than 80 and less than 86, otherwise show Nan
grades[(grades > 80) & ( grades < 86)]

       Walley  Eva  Sam  Katie   Bob
Test1     NaN  NaN  NaN    NaN  83.0
Test2     NaN  NaN  NaN   81.0   NaN
Test3     NaN  NaN  NaN   82.0  85.0

In [6]:
# Show only those values that are less than 80 or greater than 86, otherwise show Nan
grades[(grades < 80) | ( grades > 86)]

       Walley  Eva  Sam  Katie   Bob
Test1      87  100   94  100.0   NaN
Test2      96   87   77    NaN  65.0
Test3      70   90   90    NaN   NaN

## Self Practice Exercises

1) Display the students who obtained 90 marks.

In [7]:
grades[grades == 90]

       Walley   Eva   Sam  Katie  Bob
Test1     NaN   NaN   NaN    NaN  NaN
Test2     NaN   NaN   NaN    NaN  NaN
Test3     NaN  90.0  90.0    NaN  NaN

2) Display the students who obtained between 65 and 70 inclusive for Test 2 only.

In [8]:
grades[(grades >= 65) & (grades <= 70)].loc["Test2"]

Walley     NaN
Eva        NaN
Sam        NaN
Katie      NaN
Bob       65.0
Name: Test2, dtype: float64

3) Display the tests which Sam scored less than 90.

In [10]:
grades[grades < 90]["Sam"]

Test1     NaN
Test2    77.0
Test3     NaN
Name: Sam, dtype: float64